bierner.markdown-mermaid
charliermarsh.ruff
dbaeumer.vscode-eslint
google.gemini-cli-vscode-ide-companion
google.geminicodeassist
khaeransori.json2csv
mechatroner.rainbow-csv
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-azurevirtualmachines
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-python.black-formatter
ms-python.debugpy
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.powershell
ms-vscode.remote-explorer
ms-vscode.remote-server
njpwerner.autodocstring
patbenatar.advanced-new-file
visualstudiotoolsforunity.vstuc
vscodevim.vim
yzhang.markdown-all-in-one